In [1]:
import csv
import psycopg2
import pandas as pd

In [2]:
try:
    conn = psycopg2.connect("dbname='Bank_Closures' user='postgres' host='localhost' password='postgres'")
except:
    print("I am unable to connect to the database")

cur = conn.cursor()

In [3]:
cur.execute("""
    DROP TABLE IF EXISTS Bank_List;
    CREATE TABLE Bank_List (
                id SERIAL NOT NULL PRIMARY KEY,
                bank_name VARCHAR(150),
                city VARCHAR(50),
                state VARCHAR(2),
                cert INT,
                acqinst VARCHAR(100),
                date_of_closure VARCHAR(10)
           );
""")

In [4]:
with open('banklist.csv', 'r') as f:
    reader = csv.reader(f)
    next(reader) # Skip the header row.
    for row in reader:
        cur.execute(
        "INSERT INTO Bank_List (bank_name, city, state, cert, acqinst, date_of_closure) VALUES (%s, %s, %s, %s, %s, %s)",
        row
    )

We will convert the values in column "date_of_acquisition" from strings to nicer-looking dates using the **to_date** function.

In [5]:
cur.execute("""ALTER TABLE Bank_List ALTER COLUMN date_of_closure TYPE DATE 
            using to_date(date_of_closure, 'DD-Mon-YY');""")
conn.commit()

Set up to print information by connecting to database with **SQLAlchemy**

In [6]:
from sqlalchemy import create_engine

engine = create_engine('postgresql://postgres:postgres@localhost:5432/Bank_Closures')
alconn = engine.raw_connection()
alcur = alconn.cursor()

Print a sample of our table **bank_list**, with clean dates in **date_of_closure** column

In [7]:
df = pd.read_sql_table("bank_list", engine)
df

,id,bank_name,city,state,cert,acqinst,date_of_closure
0,1,Old Harbor Bank,Clearwater,FL,57537,1st United Bank,2011-10-21
1,2,"The Bank of Miami,N.A.",Coral Gables,FL,19040,1st United Bank,2010-12-17
2,3,"Republic Federal Bank, N.A.",Miami,FL,22846,1st United Bank,2009-12-11
3,4,The Bank of Commerce,Wood Dale,IL,34292,Advantage National Bank Group,2011-03-25
4,5,Prosperan Bank,Oakdale,MN,35074,"Alerus Financial, N.A.",2009-11-06
...,...,...,...,...,...,...,...
556,557,City Bank,Lynnwood,WA,21521,Whidbey Island Bank,2010-04-16
557,558,First NBC Bank,New Orleans,LA,58302,Whitney Bank,2017-04-28
558,559,Mirae Bank,Los Angeles,CA,57332,Wilshire State Bank,2009-06-26
559,560,Virginia Business Bank,Richmond,VA,58283,Xenith Bank,2011-07-29
560,561,First Federal Bank,Lexington,KY,29594,Your Community Bank,2013-04-19

Set up table of bank closures, grouped by **date**

In [8]:
cur.execute("""
    DROP TABLE IF EXISTS Closures_by_Date;
    CREATE TABLE Closures_by_Date (
        id SERIAL NOT NULL PRIMARY KEY,
        date_of_closure DATE,
        closure_count INTEGER
    );
""")

In [9]:
cur.execute("""INSERT INTO Closures_by_Date (date_of_closure, closure_count) 
                SELECT Bank_List.date_of_closure, 
                COUNT (*) FROM Bank_List GROUP BY Bank_List.date_of_closure;""")
conn.commit()

Print the **5 dates** with the biggest number of bank closures

In [10]:
df = pd.read_sql_table("closures_by_date", engine)
df.sort_values(by=['closure_count'], inplace=True, ascending=False)
df.head()

      id date_of_closure  closure_count
129  130      2009-10-30              9
199  200      2010-04-16              8
138  139      2010-08-20              8
10    11      2009-10-23              7
54    55      2010-07-23              7

Set up table of bank closures, grouped by **state**

In [11]:
cur.execute("""
    DROP TABLE IF EXISTS Closures_by_State;
    CREATE TABLE Closures_by_State (
        id SERIAL NOT NULL PRIMARY KEY,
        state VARCHAR(2),
        closure_count INTEGER
    );
""")

In [12]:
cur.execute("""INSERT INTO Closures_by_State (state, closure_count) 
                SELECT Bank_List.state, 
                COUNT (*) FROM Bank_List GROUP BY Bank_List.state;""")
conn.commit()

Print the **5 states** with the biggest number of bank closures

In [13]:
df = pd.read_sql_table("closures_by_state", engine)
df.sort_values(by=['closure_count'], inplace=True, ascending=False)
df.head(5)

    id state  closure_count
37  38    GA             93
22  23    FL             75
41  42    IL             69
27  28    CA             41
38  39    MN             23

Set up table of bank closures, grouped by **acquiring institution**

In [14]:
cur.execute("""
    DROP TABLE IF EXISTS Acquiring_Institution;
    CREATE TABLE Acquiring_Institution (
        id SERIAL NOT NULL PRIMARY KEY,
        Acquiring_Institution VARCHAR(100) UNIQUE,
        closure_count INTEGER
    );
""")

In [15]:
cur.execute("""INSERT INTO Acquiring_Institution (acquiring_institution, closure_count) 
                SELECT Bank_List.acqinst, 
                COUNT (*) FROM Bank_List GROUP BY Bank_List.acqinst;""")
conn.commit()

Print the **5 Acquiring Institutions** with the biggest number of.... acquired institutions.

In [16]:
df = pd.read_sql_table("acquiring_institution", engine)
df.sort_values(by=['closure_count'], inplace=True, ascending=False)
df.head(5)

      id                acquiring_institution  closure_count
214  215                          No Acquirer             31
258  259         State Bank and Trust Company             12
76    77  First-Citizens Bank & Trust Company             11
101  102                          Ameris Bank             10
109  110                       U.S. Bank N.A.              9

In [17]:
conn.commit()

In [18]:
conn.close()